# -*-coding: utf-8 -
'''
    @author: MD. Nazmuddoha Ansary
'''
#--------------------
# imports
#--------------------
class english:
    iden = "english"
    lower= ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"]
    upper=["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"]
    top_exts =    []
    bot_exts =    []
    vowel_diacritics       =    []
    consonant_diacritics   =    []
    modifiers              =    []
    connector              =    None
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                '{', '|', '}', '~']
    numbers                =    ["0","1","2","3","4","5","6","7","8","9"]
    graphemes              =    sorted(lower+upper+numbers+punctuations) 
    dict_graphemes         =    lower+upper
    
class bangla:
    iden                   =    "bangla"
    vowels                 =    ['অ', 'আ', 'ই', 'ঈ', 'উ', 'ঊ', 'ঋ', 'এ', 'ঐ', 'ও', 'ঔ']
    consonants             =    ['ক', 'খ', 'গ', 'ঘ', 'ঙ', 
                                'চ', 'ছ','জ', 'ঝ', 'ঞ', 
                                'ট', 'ঠ', 'ড', 'ঢ', 'ণ', 
                                'ত', 'থ', 'দ', 'ধ', 'ন', 
                                'প', 'ফ', 'ব', 'ভ', 'ম', 
                                'য', 'র', 'ল', 'শ', 'ষ', 
                                'স', 'হ','ড়', 'ঢ়', 'য়','ং', 'ঃ','ৎ']
    numbers                =    ['০', '১', '২', '৩', '৪', '৫', '৬', '৭', '৮', '৯']
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।']
    # for grapheme decomp
    vowel_diacritics       =    ['া', 'ি', 'ী', 'ু', 'ূ', 'ৃ', 'ে', 'ৈ', 'ো', 'ৌ']
    consonant_diacritics   =    ['ঁ', 'র্', 'র্য', '্য', '্র', '্র্য', 'র্্র']
    modifiers              =    []
    connector              =    '্'
    # special charecters
    special_charecters     =    [connector,'\u200d']
    # for synthetic data creation
    top_exts               =    ['ই', 'ঈ', 'উ', 'ঊ', 'ঐ','ঔ','ট', 'ঠ',' ি', 'ী', 'ৈ', 'ৌ','ঁ','র্']
    bot_exts               =    ['ু', 'ূ', 'ৃ',]
    # dict graphemes
    dict_graphemes         =    ['ং','ঃ','অ','অঁ','অ্যা','অ্যাঁ','আ','আঁ','ই','ইঁ','ঈ','ঈঁ','উ','উঁ','ঊ','ঊঁ','ঋ','ঋঁ','এ','এঁ',
                                'ঐ','ঐঁ','ও','ওঁ','ঔ','ঔঁ','ক','কঁ','কা','কাঁ','কি','কিঁ','কী','কীঁ','কু','কুঁ','কূ','কূঁ','কৃ','কৃঁ',
                                'কে','কেঁ','কৈ','কৈঁ','কো','কোঁ','কৌ','কৌঁ','ক্ক','ক্কঁ','ক্কা','ক্কাঁ','ক্কি','ক্কী','ক্কু','ক্কূ','ক্কৃ','ক্কে','ক্কৈ','ক্কো',
                                'ক্কৌ','ক্ট','ক্টঁ','ক্টা','ক্টি','ক্টী','ক্টু','ক্টূ','ক্টৃ','ক্টে','ক্টৈ','ক্টো','ক্টৌ','ক্ট্র','ক্ট্রা','ক্ট্রি','ক্ট্রী','ক্ট্রে','ক্ট্রো','ক্ত',
                                'ক্তঁ','ক্তা','ক্তি','ক্তী','ক্তু','ক্তূ','ক্তৃ','ক্তে','ক্তৈ','ক্তো','ক্তৌ','ক্ত্র','ক্ত্রঁ','ক্ত্রা','ক্ত্রি','ক্ত্রী','ক্ত্রু','ক্ত্রূ','ক্ত্রৃ','ক্ত্রে',
                                'ক্ত্রৈ','ক্ত্রো','ক্ত্রৌ','ক্ব','ক্বঁ','ক্বা','ক্বি','ক্বিঁ','ক্বী','ক্বু','ক্বূ','ক্বৃ','ক্বে','ক্বৈ','ক্বো','ক্বৌ','ক্ম','ক্মঁ','ক্মা','ক্মি',
                                'ক্মী','ক্মু','ক্মূ','ক্মৃ','ক্মে','ক্মৈ','ক্মো','ক্মৌ','ক্য','ক্যঁ','ক্যা','ক্যাঁ','ক্যি','ক্যী','ক্যু','ক্যুঁ','ক্যূ','ক্যৃ','ক্যে','ক্যেঁ',
                                'ক্যৈ','ক্যো','ক্যোঁ','ক্যৌ','ক্র','ক্রঁ','ক্রা','ক্রাঁ','ক্রি','ক্রিঁ','ক্রী','ক্রু','ক্রূ','ক্রৃ','ক্রে','ক্রেঁ','ক্রৈ','ক্রো','ক্রোঁ','ক্রৌ',
                                'ক্ল','ক্লঁ','ক্লা','ক্লাঁ','ক্লি','ক্লী','ক্লু','ক্লূ','ক্লৃ','ক্লে','ক্লৈ','ক্লো','ক্লৌ','ক্ষ','ক্ষঁ','ক্ষা','ক্ষি','ক্ষী','ক্ষীঁ','ক্ষু',
                                'ক্ষুঁ','ক্ষূ','ক্ষৃ','ক্ষে','ক্ষেঁ','ক্ষৈ','ক্ষো','ক্ষোঁ','ক্ষৌ','ক্ষ্ণ','ক্ষ্ণঁ','ক্ষ্ণা','ক্ষ্ণি','ক্ষ্ণী','ক্ষ্ণু','ক্ষ্ণূ','ক্ষ্ণৃ','ক্ষ্ণে','ক্ষ্ণৈ','ক্ষ্ণো',
                                'ক্ষ্ণৌ','ক্ষ্ব','ক্ষ্বা','ক্ষ্বি','ক্ষ্বু','ক্ষ্বৃ','ক্ষ্বে','ক্ষ্ম','ক্ষ্মঁ','ক্ষ্মা','ক্ষ্মি','ক্ষ্মী','ক্ষ্মু','ক্ষ্মূ','ক্ষ্মৃ','ক্ষ্মে','ক্ষ্মৈ','ক্ষ্মো','ক্ষ্মৌ','ক্ষ্ম্য',
                                'ক্ষ্ম্যা','ক্ষ্ম্যে','ক্ষ্ম্যৈ','ক্ষ্য','ক্ষ্যঁ','ক্ষ্যা','ক্ষ্যাঁ','ক্ষ্যি','ক্ষ্যী','ক্ষ্যু','ক্ষ্যূ','ক্ষ্যৃ','ক্ষ্যে','ক্ষ্যৈ','ক্ষ্যো','ক্ষ্যৌ','ক্স','ক্সঁ','ক্সা','ক্সাঁ',
                                'ক্সি','ক্সী','ক্সু','ক্সূ','ক্সৃ','ক্সে','ক্সৈ','ক্সো','ক্সৌ','খ','খঁ','খা','খাঁ','খি','খিঁ','খী','খীঁ','খু','খুঁ','খূ',
                                'খূঁ','খৃ','খে','খেঁ','খৈ','খো','খোঁ','খৌ','খৌঁ','খ্য','খ্যা','খ্যাঁ','খ্যি','খ্যী','খ্যু','খ্যূ','খ্যে','খ্যৈ','খ্যো','খ্যোঁ',
                                'খ্র','খ্রা','খ্রি','খ্রী','খ্রু','খ্রূ','খ্রৃ','খ্রে','খ্রো','খ্রোঁ','গ','গঁ','গা','গাঁ','গি','গিঁ','গী','গীঁ','গু','গুঁ',
                                'গূ','গূঁ','গৃ','গে','গেঁ','গৈ','গো','গোঁ','গৌ','গৌঁ','গ্ণ','গ্ণঁ','গ্ণা','গ্ণি','গ্ণী','গ্ণু','গ্ণূ','গ্ণৃ','গ্ণে','গ্ণৈ',
                                'গ্ণো','গ্ণৌ','গ্ধ','গ্ধঁ','গ্ধা','গ্ধি','গ্ধী','গ্ধু','গ্ধূ','গ্ধৃ','গ্ধে','গ্ধৈ','গ্ধো','গ্ধৌ','গ্ধ্য','গ্ধ্যে','গ্ন','গ্নঁ','গ্না','গ্নি',
                                'গ্নী','গ্নু','গ্নূ','গ্নৃ','গ্নে','গ্নৈ','গ্নো','গ্নৌ','গ্ন্য','গ্ন্যঁ','গ্ন্যা','গ্ন্যি','গ্ন্যী','গ্ন্যু','গ্ন্যূ','গ্ন্যৃ','গ্ন্যে','গ্ন্যৈ','গ্ন্যো','গ্ন্যৌ',
                                'গ্ব','গ্বা','গ্বি','গ্বী','গ্বু','গ্বে','গ্বৈ','গ্বো','গ্ম','গ্মঁ','গ্মা','গ্মি','গ্মী','গ্মু','গ্মূ','গ্মৃ','গ্মে','গ্মৈ','গ্মো','গ্মৌ',
                                'গ্য','গ্যঁ','গ্যা','গ্যাঁ','গ্যি','গ্যী','গ্যু','গ্যে','গ্যেঁ','গ্যৈ','গ্যো','গ্র','গ্রঁ','গ্রা','গ্রাঁ','গ্রি','গ্রিঁ','গ্রী','গ্রু','গ্রূ',
                                'গ্রৃ','গ্রে','গ্রেঁ','গ্রৈ','গ্রো','গ্রৌ','গ্র্য','গ্র্যঁ','গ্র্যা','গ্র্যাঁ','গ্র্যি','গ্র্যী','গ্র্যু','গ্র্যূ','গ্র্যৃ','গ্র্যে','গ্র্যৈ','গ্র্যো','গ্র্যৌ','গ্ল',
                                'গ্লঁ','গ্লা','গ্লি','গ্লী','গ্লু','গ্লূ','গ্লৃ','গ্লে','গ্লৈ','গ্লো','গ্লৌ','ঘ','ঘঁ','ঘা','ঘাঁ','ঘি','ঘিঁ','ঘী','ঘীঁ','ঘু',
                                'ঘুঁ','ঘূ','ঘূঁ','ঘৃ','ঘে','ঘেঁ','ঘৈ','ঘো','ঘোঁ','ঘৌ','ঘ্ন','ঘ্নঁ','ঘ্না','ঘ্নি','ঘ্নী','ঘ্নু','ঘ্নূ','ঘ্নৃ','ঘ্নে','ঘ্নৈ',
                                'ঘ্নো','ঘ্নৌ','ঘ্য','ঘ্যা','ঘ্যাঁ','ঘ্যু','ঘ্যে','ঘ্যো','ঘ্যোঁ','ঘ্র','ঘ্রঁ','ঘ্রা','ঘ্রাঁ','ঘ্রি','ঘ্রী','ঘ্রু','ঘ্রে','ঘ্রো','ঙ','ঙঁ',
                                'ঙা','ঙাঁ','ঙি','ঙী','ঙু','ঙূ','ঙৃ','ঙে','ঙৈ','ঙো','ঙৌ','ঙ্ক','ঙ্কঁ','ঙ্কা','ঙ্কাঁ','ঙ্কি','ঙ্কী','ঙ্কু','ঙ্কূ','ঙ্কৃ',
                                'ঙ্কে','ঙ্কেঁ','ঙ্কৈ','ঙ্কো','ঙ্কৌ','ঙ্ক্ত','ঙ্ক্তি','ঙ্ক্তে','ঙ্ক্য','ঙ্ক্যঁ','ঙ্ক্যা','ঙ্ক্যি','ঙ্ক্যী','ঙ্ক্যু','ঙ্ক্যূ','ঙ্ক্যৃ','ঙ্ক্যে','ঙ্ক্যৈ','ঙ্ক্যো','ঙ্ক্যৌ',
                                'ঙ্ক্ষ','ঙ্ক্ষঁ','ঙ্ক্ষা','ঙ্ক্ষি','ঙ্ক্ষী','ঙ্ক্ষু','ঙ্ক্ষূ','ঙ্ক্ষৃ','ঙ্ক্ষে','ঙ্ক্ষৈ','ঙ্ক্ষো','ঙ্ক্ষৌ','ঙ্খ','ঙ্খঁ','ঙ্খা','ঙ্খি','ঙ্খী','ঙ্খু','ঙ্খূ','ঙ্খৃ',
                                'ঙ্খে','ঙ্খৈ','ঙ্খো','ঙ্খৌ','ঙ্খ্য','ঙ্খ্যা','ঙ্গ','ঙ্গঁ','ঙ্গা','ঙ্গাঁ','ঙ্গি','ঙ্গিঁ','ঙ্গী','ঙ্গীঁ','ঙ্গু','ঙ্গুঁ','ঙ্গূ','ঙ্গৃ','ঙ্গে','ঙ্গেঁ',
                                'ঙ্গৈ','ঙ্গো','ঙ্গোঁ','ঙ্গৌ','ঙ্গ্য','ঙ্গ্যঁ','ঙ্গ্যা','ঙ্গ্যাঁ','ঙ্গ্যি','ঙ্গ্যী','ঙ্গ্যু','ঙ্গ্যূ','ঙ্গ্যৃ','ঙ্গ্যে','ঙ্গ্যৈ','ঙ্গ্যো','ঙ্গ্যৌ','ঙ্ঘ','ঙ্ঘা','ঙ্ঘি',
                                'ঙ্ঘী','ঙ্ঘু','ঙ্ঘৃ','ঙ্ঘে','ঙ্ঘো','ঙ্ঘ্য','ঙ্ঘ্যা','ঙ্ঘ্যে','ঙ্ঘ্র','ঙ্ঘ্রঁ','ঙ্ঘ্রা','ঙ্ঘ্রি','ঙ্ঘ্রী','ঙ্ঘ্রু','ঙ্ঘ্রূ','ঙ্ঘ্রৃ','ঙ্ঘ্রে','ঙ্ঘ্রৈ','ঙ্ঘ্রো','ঙ্ঘ্রৌ',
                                'ঙ্ম','ঙ্মঁ','ঙ্মা','ঙ্মি','ঙ্মী','ঙ্মু','ঙ্মূ','ঙ্মৃ','ঙ্মে','ঙ্মৈ','ঙ্মো','ঙ্মৌ','চ','চঁ','চা','চাঁ','চি','চিঁ','চী','চীঁ',
                                'চু','চুঁ','চূ','চূঁ','চৃ','চে','চেঁ','চৈ','চৈঁ','চো','চোঁ','চৌ','চৌঁ','চ্চ','চ্চঁ','চ্চা','চ্চি','চ্চী','চ্চু','চ্চূ',
                                'চ্চৃ','চ্চে','চ্চৈ','চ্চো','চ্চোঁ','চ্চৌ','চ্ছ','চ্ছঁ','চ্ছা','চ্ছাঁ','চ্ছি','চ্ছী','চ্ছু','চ্ছূ','চ্ছৃ','চ্ছে','চ্ছৈ','চ্ছো','চ্ছৌ','চ্ছ্ব',
                                'চ্ছ্বঁ','চ্ছ্বা','চ্ছ্বি','চ্ছ্বী','চ্ছ্বু','চ্ছ্বূ','চ্ছ্বৃ','চ্ছ্বে','চ্ছ্বৈ','চ্ছ্বো','চ্ছ্বৌ','চ্ছ্র','চ্ছ্রঁ','চ্ছ্রা','চ্ছ্রি','চ্ছ্রী','চ্ছ্রু','চ্ছ্রূ','চ্ছ্রৃ','চ্ছ্রে',
                                'চ্ছ্রৈ','চ্ছ্রো','চ্ছ্রৌ','চ্ঞ','চ্ঞঁ','চ্ঞা','চ্ঞি','চ্ঞী','চ্ঞু','চ্ঞূ','চ্ঞৃ','চ্ঞে','চ্ঞৈ','চ্ঞো','চ্ঞৌ','চ্ব','চ্বা','চ্বি','চ্বু','চ্বে',
                                'চ্বো','চ্য','চ্যা','চ্যাঁ','চ্যি','চ্যী','চ্যু','চ্যূ','চ্যৃ','চ্যে','চ্যৈ','চ্যো','ছ','ছঁ','ছা','ছাঁ','ছি','ছিঁ','ছী','ছু',
                                'ছুঁ','ছূ','ছূঁ','ছৃ','ছে','ছেঁ','ছৈ','ছৈঁ','ছো','ছোঁ','ছৌ','ছৌঁ','জ','জঁ','জা','জাঁ','জি','জিঁ','জী','জীঁ',
                                'জু','জুঁ','জূ','জূঁ','জৃ','জে','জেঁ','জৈ','জো','জোঁ','জৌ','জৌঁ','জ্জ','জ্জঁ','জ্জা','জ্জি','জ্জী','জ্জু','জ্জূ','জ্জৃ',
                                'জ্জে','জ্জৈ','জ্জো','জ্জৌ','জ্জ্ব','জ্জ্বঁ','জ্জ্বা','জ্জ্বি','জ্জ্বী','জ্জ্বু','জ্জ্বূ','জ্জ্বৃ','জ্জ্বে','জ্জ্বৈ','জ্জ্বো','জ্জ্বৌ','জ্ঝ','জ্ঝঁ','জ্ঝা','জ্ঝি',
                                'জ্ঝী','জ্ঝু','জ্ঝূ','জ্ঝৃ','জ্ঝে','জ্ঝৈ','জ্ঝো','জ্ঝৌ','জ্ঞ','জ্ঞঁ','জ্ঞা','জ্ঞাঁ','জ্ঞি','জ্ঞী','জ্ঞু','জ্ঞূ','জ্ঞৃ','জ্ঞে','জ্ঞৈ','জ্ঞো',
                                'জ্ঞৌ','জ্ব','জ্বঁ','জ্বা','জ্বাঁ','জ্বি','জ্বিঁ','জ্বী','জ্বু','জ্বূ','জ্বৃ','জ্বে','জ্বৈ','জ্বো','জ্বৌ','জ্য','জ্যঁ','জ্যা','জ্যাঁ','জ্যি',
                                'জ্যী','জ্যু','জ্যুঁ','জ্যূ','জ্যে','জ্যৈ','জ্যো','জ্যোঁ','জ্যৌ','জ্র','জ্রঁ','জ্রা','জ্রি','জ্রী','জ্রু','জ্রূ','জ্রৃ','জ্রে','জ্রৈ','জ্রো',
                                'জ্রোঁ','জ্রৌ','ঝ','ঝঁ','ঝা','ঝাঁ','ঝি','ঝিঁ','ঝী','ঝু','ঝুঁ','ঝূ','ঝূঁ','ঝৃ','ঝৃঁ','ঝে','ঝেঁ','ঝো','ঝোঁ','ঝৌ',
                                'ঞ','ঞঁ','ঞা','ঞাঁ','ঞি','ঞী','ঞু','ঞুঁ','ঞূ','ঞৃ','ঞে','ঞেঁ','ঞো','ঞ্চ','ঞ্চঁ','ঞ্চা','ঞ্চাঁ','ঞ্চি','ঞ্চিঁ','ঞ্চী',
                                'ঞ্চু','ঞ্চূ','ঞ্চৃ','ঞ্চে','ঞ্চৈ','ঞ্চো','ঞ্চৌ','ঞ্ছ','ঞ্ছা','ঞ্ছি','ঞ্ছী','ঞ্ছু','ঞ্ছে','ঞ্ছো','ঞ্জ','ঞ্জা','ঞ্জাঁ','ঞ্জি','ঞ্জী','ঞ্জু',
                                'ঞ্জূ','ঞ্জৃ','ঞ্জে','ঞ্জো','ঞ্জৌ','ঞ্ঝ','ঞ্ঝা','ঞ্ঝি','ঞ্ঝী','ঞ্ঝু','ঞ্ঝে','ঞ্ঝো','ট','টঁ','টা','টাঁ','টি','টিঁ','টী','টু',
                                'টুঁ','টূ','টূঁ','টৃ','টে','টেঁ','টৈ','টো','টোঁ','টৌ','টৌঁ','ট্ট','ট্টঁ','ট্টা','ট্টি','ট্টী','ট্টু','ট্টূ','ট্টৃ','ট্টে',
                                'ট্টৈ','ট্টো','ট্টৌ','ট্ব','ট্বঁ','ট্বা','ট্বি','ট্বী','ট্বু','ট্বূ','ট্বৃ','ট্বে','ট্বৈ','ট্বো','ট্বৌ','ট্ম','ট্মঁ','ট্মা','ট্মি','ট্মী',
                                'ট্মু','ট্মূ','ট্মৃ','ট্মে','ট্মৈ','ট্মো','ট্মৌ','ট্য','ট্যঁ','ট্যা','ট্যাঁ','ট্যি','ট্যু','ট্যূ','ট্যে','ট্যৈ','ট্যো','ট্র','ট্রঁ','ট্রা',
                                'ট্রি','ট্রিঁ','ট্রী','ট্রু','ট্রূ','ট্রৃ','ট্রে','ট্রৈ','ট্রো','ট্রোঁ','ট্রৌ','ঠ','ঠঁ','ঠা','ঠাঁ','ঠি','ঠিঁ','ঠী','ঠু','ঠুঁ',
                                'ঠূ','ঠে','ঠেঁ','ঠৈ','ঠৈঁ','ঠো','ঠোঁ','ঠৌ','ঠৌঁ','ড','ডঁ','ডা','ডাঁ','ডি','ডিঁ','ডী','ডু','ডুঁ','ডূ','ডৃ',
                                'ডে','ডেঁ','ডৈ','ডো','ডোঁ','ডৌ','ড্ড','ড্ডা','ড্ডাঁ','ড্ডি','ড্ডী','ড্ডু','ড্ডূ','ড্ডে','ড্ডো','ড্ব','ড্বা','ড্বি','ড্বী','ড্বু',
                                'ড্বে','ড্বো','ড্য','ড্যঁ','ড্যা','ড্যাঁ','ড্যি','ড্যী','ড্যু','ড্যূ','ড্যৃ','ড্যে','ড্যৈ','ড্যো','ড্যৌ','ড্র','ড্রঁ','ড্রা','ড্রি','ড্রী',
                                'ড্রু','ড্রূ','ড্রৃ','ড্রে','ড্রৈ','ড্রো','ড্রৌ','ঢ','ঢঁ','ঢা','ঢাঁ','ঢি','ঢিঁ','ঢী','ঢু','ঢুঁ','ঢূ','ঢৃ','ঢে','ঢেঁ',
                                'ঢৈ','ঢো','ঢোঁ','ঢৌ','ঢ্য','ঢ্যঁ','ঢ্যা','ঢ্যাঁ','ঢ্যু','ঢ্যে','ঢ্যো','ঢ্র','ঢ্রঁ','ঢ্রা','ঢ্রি','ঢ্রী','ঢ্রু','ঢ্রূ','ঢ্রৃ','ঢ্রে',
                                'ঢ্রৈ','ঢ্রো','ঢ্রৌ','ণ','ণঁ','ণা','ণি','ণী','ণু','ণূ','ণৃ','ণে','ণেঁ','ণৈ','ণো','ণৌ','ণ্ট','ণ্টঁ','ণ্টা','ণ্টি',
                                'ণ্টী','ণ্টু','ণ্টূ','ণ্টৃ','ণ্টে','ণ্টৈ','ণ্টো','ণ্টৌ','ণ্ঠ','ণ্ঠা','ণ্ঠি','ণ্ঠী','ণ্ঠু','ণ্ঠে','ণ্ঠো','ণ্ঠ্য','ণ্ঠ্যে','ণ্ড','ণ্ডা','ণ্ডি',
                                'ণ্ডী','ণ্ডু','ণ্ডূ','ণ্ডৃ','ণ্ডে','ণ্ডৈ','ণ্ডো','ণ্ডোঁ','ণ্ডৌ','ণ্ড্য','ণ্ড্যঁ','ণ্ড্যা','ণ্ড্যি','ণ্ড্যী','ণ্ড্যু','ণ্ড্যূ','ণ্ড্যৃ','ণ্ড্যে','ণ্ড্যৈ','ণ্ড্যো',
                                'ণ্ড্যৌ','ণ্ড্র','ণ্ড্রঁ','ণ্ড্রা','ণ্ড্রি','ণ্ড্রী','ণ্ড্রু','ণ্ড্রূ','ণ্ড্রৃ','ণ্ড্রে','ণ্ড্রৈ','ণ্ড্রো','ণ্ড্রৌ','ণ্ঢ','ণ্ঢা','ণ্ণ','ণ্ণা','ণ্ণি','ণ্ণী','ণ্ণু',
                                'ণ্ণে','ণ্ণো','ণ্ণৌ','ণ্ব','ণ্বা','ণ্বি','ণ্বী','ণ্বে','ণ্বো','ণ্ম','ণ্মা','ণ্মি','ণ্মু','ণ্মূ','ণ্মে','ণ্মো','ণ্য','ণ্যা','ণ্যি','ণ্যী',
                                'ণ্যু','ণ্যূ','ণ্যৃ','ণ্যে','ণ্যৈ','ণ্যো','ত','তঁ','তা','তাঁ','তি','তিঁ','তী','তীঁ','তু','তুঁ','তূ','তূঁ','তৃ','তৃঁ',
                                'তে','তেঁ','তৈ','তৈঁ','তো','তোঁ','তৌ','ত্ত','ত্তঁ','ত্তা','ত্তাঁ','ত্তি','ত্তী','ত্তু','ত্তূ','ত্তৃ','ত্তে','ত্তৈ','ত্তো','ত্তোঁ',
                                'ত্তৌ','ত্ত্ব','ত্ত্বঁ','ত্ত্বা','ত্ত্বি','ত্ত্বী','ত্ত্বু','ত্ত্বূ','ত্ত্বৃ','ত্ত্বে','ত্ত্বৈ','ত্ত্বো','ত্ত্বৌ','ত্ত্য','ত্ত্যা','ত্ত্যি','ত্ত্যু','ত্ত্যে','ত্ত্যো','ত্থ',
                                'ত্থঁ','ত্থা','ত্থি','ত্থী','ত্থু','ত্থূ','ত্থৃ','ত্থে','ত্থৈ','ত্থো','ত্থৌ','ত্ন','ত্নঁ','ত্না','ত্নি','ত্নী','ত্নু','ত্নূ','ত্নৃ','ত্নে',
                                'ত্নৈ','ত্নো','ত্নৌ','ত্ব','ত্বঁ','ত্বা','ত্বাঁ','ত্বি','ত্বী','ত্বু','ত্বূ','ত্বৃ','ত্বে','ত্বৈ','ত্বো','ত্বৌ','ত্ম','ত্মঁ','ত্মা','ত্মাঁ',
                                'ত্মি','ত্মী','ত্মু','ত্মূ','ত্মৃ','ত্মে','ত্মৈ','ত্মো','ত্মৌ','ত্ম্য','ত্ম্যঁ','ত্ম্যা','ত্ম্যি','ত্ম্যী','ত্ম্যু','ত্ম্যূ','ত্ম্যৃ','ত্ম্যে','ত্ম্যৈ','ত্ম্যো',
                                'ত্ম্যৌ','ত্য','ত্যা','ত্যাঁ','ত্যি','ত্যী','ত্যু','ত্যুঁ','ত্যূ','ত্যৃ','ত্যে','ত্যৈ','ত্যো','ত্যৌ','ত্র','ত্রঁ','ত্রা','ত্রাঁ','ত্রি','ত্রিঁ',
                                'ত্রী','ত্রু','ত্রুঁ','ত্রূ','ত্রৃ','ত্রে','ত্রেঁ','ত্রৈ','ত্রো','ত্রোঁ','ত্রৌ','ত্র্য','ত্র্যঁ','ত্র্যা','ত্র্যাঁ','ত্র্যি','ত্র্যী','ত্র্যু','ত্র্যূ','ত্র্যৃ',
                                'ত্র্যে','ত্র্যেঁ','ত্র্যৈ','ত্র্যো','ত্র্যৌ','থ','থঁ','থা','থাঁ','থি','থিঁ','থী','থীঁ','থু','থুঁ','থূ','থৃ','থে','থেঁ','থৈ',
                                'থো','থোঁ','থৌ','থ্ব','থ্বঁ','থ্বা','থ্বি','থ্বী','থ্বু','থ্বূ','থ্বৃ','থ্বে','থ্বৈ','থ্বো','থ্বৌ','থ্য','থ্যঁ','থ্যা','থ্যাঁ','থ্যি',
                                'থ্যু','থ্যূ','থ্যে','থ্যো','থ্র','থ্রঁ','থ্রা','থ্রাঁ','থ্রি','থ্রী','থ্রু','থ্রূ','থ্রৃ','থ্রে','থ্রেঁ','থ্রৈ','থ্রো','থ্রোঁ','থ্রৌ','দ',
                                'দঁ','দা','দাঁ','দি','দিঁ','দী','দু','দুঁ','দূ','দূঁ','দৃ','দে','দেঁ','দৈ','দো','দোঁ','দৌ','দৌঁ','দ্গ','দ্গঁ',
                                'দ্গা','দ্গি','দ্গী','দ্গু','দ্গুঁ','দ্গূ','দ্গৃ','দ্গে','দ্গৈ','দ্গো','দ্গৌ','দ্ঘ','দ্ঘঁ','দ্ঘা','দ্ঘাঁ','দ্ঘি','দ্ঘী','দ্ঘু','দ্ঘূ','দ্ঘৃ',
                                'দ্ঘে','দ্ঘৈ','দ্ঘো','দ্ঘৌ','দ্দ','দ্দঁ','দ্দা','দ্দি','দ্দিঁ','দ্দী','দ্দু','দ্দূ','দ্দৃ','দ্দে','দ্দৈ','দ্দো','দ্দৌ','দ্দ্ব','দ্দ্বঁ','দ্দ্বা',
                                'দ্দ্বি','দ্দ্বী','দ্দ্বু','দ্দ্বূ','দ্দ্বৃ','দ্দ্বে','দ্দ্বৈ','দ্দ্বো','দ্দ্বৌ','দ্ধ','দ্ধঁ','দ্ধা','দ্ধি','দ্ধী','দ্ধু','দ্ধূ','দ্ধৃ','দ্ধে','দ্ধৈ','দ্ধো',
                                'দ্ধৌ','দ্ব','দ্বঁ','দ্বা','দ্বাঁ','দ্বি','দ্বী','দ্বু','দ্বূ','দ্বৃ','দ্বে','দ্বৈ','দ্বো','দ্বৌ','দ্ভ','দ্ভঁ','দ্ভা','দ্ভি','দ্ভী','দ্ভু',
                                'দ্ভূ','দ্ভৃ','দ্ভে','দ্ভৈ','দ্ভো','দ্ভৌ','দ্ভ্র','দ্ভ্রা','দ্ভ্রী','দ্ভ্রে','দ্ম','দ্মঁ','দ্মা','দ্মি','দ্মী','দ্মু','দ্মূ','দ্মৃ','দ্মে','দ্মৈ',
                                'দ্মো','দ্মৌ','দ্য','দ্যঁ','দ্যা','দ্যাঁ','দ্যি','দ্যী','দ্যু','দ্যুঁ','দ্যূ','দ্যৃ','দ্যে','দ্যৈ','দ্যো','দ্যোঁ','দ্যৌ','দ্র','দ্রঁ','দ্রা',
                                'দ্রি','দ্রী','দ্রু','দ্রূ','দ্রৃ','দ্রে','দ্রেঁ','দ্রৈ','দ্রো','দ্রৌ','দ্র্য','দ্র্যঁ','দ্র্যা','দ্র্যি','দ্র্যী','দ্র্যু','দ্র্যূ','দ্র্যৃ','দ্র্যে','দ্র্যৈ',
                                'দ্র্যো','দ্র্যৌ','ধ','ধঁ','ধা','ধাঁ','ধি','ধিঁ','ধী','ধীঁ','ধু','ধুঁ','ধূ','ধূঁ','ধৃ','ধে','ধেঁ','ধৈ','ধৈঁ','ধো',
                                'ধোঁ','ধৌ','ধৌঁ','ধ্ন','ধ্নঁ','ধ্না','ধ্নি','ধ্নী','ধ্নু','ধ্নূ','ধ্নৃ','ধ্নে','ধ্নৈ','ধ্নো','ধ্নৌ','ধ্ব','ধ্বঁ','ধ্বা','ধ্বি','ধ্বী',
                                'ধ্বু','ধ্বূ','ধ্বৃ','ধ্বে','ধ্বৈ','ধ্বো','ধ্বৌ','ধ্ম','ধ্মঁ','ধ্মা','ধ্মি','ধ্মী','ধ্মু','ধ্মূ','ধ্মৃ','ধ্মে','ধ্মৈ','ধ্মো','ধ্মৌ','ধ্য',
                                'ধ্যা','ধ্যাঁ','ধ্যি','ধ্যী','ধ্যু','ধ্যূ','ধ্যে','ধ্যৈ','ধ্যো','ধ্র','ধ্রঁ','ধ্রা','ধ্রি','ধ্রী','ধ্রু','ধ্রূ','ধ্রৃ','ধ্রে','ধ্রৈ','ধ্রো',
                                'ধ্রৌ','ন','নঁ','না','নাঁ','নি','নিঁ','নী','নীঁ','নু','নুঁ','নূ','নূঁ','নৃ','নে','নেঁ','নৈ','নো','নোঁ','নৌ',
                                'নৌঁ','ন্ট','ন্টঁ','ন্টা','ন্টাঁ','ন্টি','ন্টী','ন্টু','ন্টূ','ন্টৃ','ন্টে','ন্টৈ','ন্টো','ন্টৌ','ন্ট্র','ন্ট্রা','ন্ট্রি','ন্ট্রী','ন্ট্রু','ন্ট্রে',
                                'ন্ট্রো','ন্ঠ','ন্ঠঁ','ন্ঠা','ন্ঠি','ন্ঠী','ন্ঠু','ন্ঠূ','ন্ঠৃ','ন্ঠে','ন্ঠৈ','ন্ঠো','ন্ঠৌ','ন্ড','ন্ডঁ','ন্ডা','ন্ডি','ন্ডী','ন্ডু','ন্ডূ',
                                'ন্ডৃ','ন্ডে','ন্ডৈ','ন্ডো','ন্ডৌ','ন্ড্ব','ন্ড্বা','ন্ড্র','ন্ড্রা','ন্ড্রি','ন্ড্রী','ন্ড্রু','ন্ড্রূ','ন্ড্রে','ন্ড্রো','ন্ত','ন্তঁ','ন্তা','ন্তি','ন্তী',
                                'ন্তীঁ','ন্তু','ন্তূ','ন্তৃ','ন্তে','ন্তৈ','ন্তো','ন্তৌ','ন্ত্ব','ন্ত্বঁ','ন্ত্বা','ন্ত্বি','ন্ত্বী','ন্ত্বু','ন্ত্বূ','ন্ত্বৃ','ন্ত্বে','ন্ত্বৈ','ন্ত্বো','ন্ত্বৌ',
                                'ন্ত্য','ন্ত্যা','ন্ত্যাঁ','ন্ত্যী','ন্ত্যৃ','ন্ত্যে','ন্ত্যো','ন্ত্র','ন্ত্রঁ','ন্ত্রা','ন্ত্রি','ন্ত্রী','ন্ত্রু','ন্ত্রূ','ন্ত্রৃ','ন্ত্রে','ন্ত্রৈ','ন্ত্রো','ন্ত্রৌ','ন্ত্র্য',
                                'ন্ত্র্যঁ','ন্ত্র্যা','ন্ত্র্যি','ন্ত্র্যী','ন্ত্র্যু','ন্ত্র্যূ','ন্ত্র্যৃ','ন্ত্র্যে','ন্ত্র্যৈ','ন্ত্র্যো','ন্ত্র্যৌ','ন্থ','ন্থা','ন্থি','ন্থী','ন্থু','ন্থে','ন্থৈ','ন্থো','ন্থোঁ',
                                'ন্থৌ','ন্থ্র','ন্থ্রা','ন্থ্রি','ন্থ্রো','ন্দ','ন্দঁ','ন্দা','ন্দাঁ','ন্দি','ন্দী','ন্দু','ন্দুঁ','ন্দূ','ন্দৃ','ন্দে','ন্দেঁ','ন্দৈ','ন্দো','ন্দৌ',
                                'ন্দ্ব','ন্দ্বঁ','ন্দ্বা','ন্দ্বি','ন্দ্বী','ন্দ্বু','ন্দ্বূ','ন্দ্বৃ','ন্দ্বে','ন্দ্বৈ','ন্দ্বো','ন্দ্বৌ','ন্দ্য','ন্দ্যা','ন্দ্যি','ন্দ্যু','ন্দ্যে','ন্দ্যো','ন্দ্র','ন্দ্রঁ',
                                'ন্দ্রা','ন্দ্রি','ন্দ্রী','ন্দ্রু','ন্দ্রূ','ন্দ্রৃ','ন্দ্রে','ন্দ্রেঁ','ন্দ্রৈ','ন্দ্রো','ন্দ্রৌ','ন্ধ','ন্ধঁ','ন্ধা','ন্ধাঁ','ন্ধি','ন্ধী','ন্ধু','ন্ধুঁ','ন্ধূ',
                                'ন্ধৃ','ন্ধে','ন্ধেঁ','ন্ধৈ','ন্ধো','ন্ধোঁ','ন্ধৌ','ন্ধ্য','ন্ধ্যঁ','ন্ধ্যা','ন্ধ্যাঁ','ন্ধ্যি','ন্ধ্যী','ন্ধ্যু','ন্ধ্যূ','ন্ধ্যৃ','ন্ধ্যে','ন্ধ্যৈ','ন্ধ্যো','ন্ধ্যৌ',
                                'ন্ধ্র','ন্ধ্রঁ','ন্ধ্রা','ন্ধ্রি','ন্ধ্রী','ন্ধ্রু','ন্ধ্রূ','ন্ধ্রৃ','ন্ধ্রে','ন্ধ্রৈ','ন্ধ্রো','ন্ধ্রৌ','ন্ন','ন্নঁ','ন্না','ন্নাঁ','ন্নি','ন্নী','ন্নু','ন্নূ',
                                'ন্নৃ','ন্নে','ন্নৈ','ন্নো','ন্নৌ','ন্ব','ন্বঁ','ন্বা','ন্বি','ন্বী','ন্বু','ন্বূ','ন্বৃ','ন্বে','ন্বৈ','ন্বো','ন্বৌ','ন্ম','ন্মঁ','ন্মা',
                                'ন্মি','ন্মী','ন্মু','ন্মূ','ন্মৃ','ন্মে','ন্মৈ','ন্মো','ন্মৌ','ন্য','ন্যঁ','ন্যা','ন্যাঁ','ন্যি','ন্যী','ন্যু','ন্যুঁ','ন্যূ','ন্যৃ','ন্যে',
                                'ন্যেঁ','ন্যৈ','ন্যো','ন্যৌ','ন্স','ন্সা','ন্সি','ন্সী','ন্সু','ন্সূ','ন্সৃ','ন্সে','ন্সৈ','ন্সো','প','পঁ','পা','পাঁ','পি','পিঁ',
                                'পী','পীঁ','পু','পুঁ','পূ','পূঁ','পৃ','পৃঁ','পে','পেঁ','পৈ','পৈঁ','পো','পোঁ','পৌ','পৌঁ','প্ট','প্টঁ','প্টা','প্টাঁ',
                                'প্টি','প্টী','প্টু','প্টূ','প্টৃ','প্টে','প্টৈ','প্টো','প্টৌ','প্ত','প্তঁ','প্তা','প্তি','প্তী','প্তু','প্তূ','প্তৃ','প্তে','প্তৈ','প্তো',
                                'প্তৌ','প্ন','প্নঁ','প্না','প্নি','প্নী','প্নু','প্নূ','প্নৃ','প্নে','প্নৈ','প্নো','প্নোঁ','প্নৌ','প্প','প্পঁ','প্পা','প্পাঁ','প্পি','প্পী',
                                'প্পু','প্পূ','প্পৃ','প্পে','প্পৈ','প্পো','প্পৌ','প্য','প্যঁ','প্যা','প্যাঁ','প্যি','প্যী','প্যু','প্যূ','প্যৃ','প্যে','প্যেঁ','প্যো','প্র',
                                'প্রঁ','প্রা','প্রাঁ','প্রি','প্রিঁ','প্রী','প্রু','প্রুঁ','প্রূ','প্রৃ','প্রে','প্রেঁ','প্রৈ','প্রো','প্রোঁ','প্রৌ','প্র্য','প্র্যঁ','প্র্যা','প্র্যাঁ',
                                'প্র্যি','প্র্যী','প্র্যু','প্র্যূ','প্র্যৃ','প্র্যে','প্র্যৈ','প্র্যো','প্র্যৌ','প্ল','প্লঁ','প্লা','প্লাঁ','প্লি','প্লী','প্লু','প্লূ','প্লৃ','প্লে','প্লৈ',
                                'প্লো','প্লৌ','প্স','প্সঁ','প্সা','প্সি','প্সী','প্সু','প্সূ','প্সৃ','প্সে','প্সৈ','প্সো','প্সৌ','ফ','ফঁ','ফা','ফাঁ','ফি','ফিঁ',
                                'ফী','ফু','ফুঁ','ফূ','ফূঁ','ফৃ','ফে','ফেঁ','ফৈ','ফো','ফোঁ','ফৌ','ফৌঁ','ফ্র','ফ্রঁ','ফ্রা','ফ্রাঁ','ফ্রি','ফ্রী','ফ্রু',
                                'ফ্রূ','ফ্রৃ','ফ্রে','ফ্রেঁ','ফ্রৈ','ফ্রো','ফ্রোঁ','ফ্রৌ','ফ্ল','ফ্লঁ','ফ্লা','ফ্লি','ফ্লী','ফ্লু','ফ্লূ','ফ্লৃ','ফ্লে','ফ্লৈ','ফ্লো','ফ্লোঁ',
                                'ফ্লৌ','ব','বঁ','বা','বাঁ','বি','বিঁ','বী','বীঁ','বু','বুঁ','বূ','বৃ','বে','বেঁ','বৈ','বৈঁ','বো','বোঁ','বৌ',
                                'বৌঁ','ব্ব','ব্বঁ','ব্বা','ব্বাঁ','ব্বি','ব্বিঁ','ব্বী','ব্বু','ব্বূ','ব্বৃ','ব্বে','ব্বৈ','ব্বো','ব্বৌ','ব্য','ব্যঁ','ব্যা','ব্যাঁ','ব্যি',
                                'ব্যী','ব্যু','ব্যূ','ব্যৃ','ব্যে','ব্যেঁ','ব্যৈ','ব্যো','ব্যোঁ','ব্যৌ','ব্র','ব্রঁ','ব্রা','ব্রাঁ','ব্রি','ব্রী','ব্রু','ব্রূ','ব্রৃ','ব্রে',
                                'ব্রেঁ','ব্রৈ','ব্রো','ব্রৌ','ভ','ভঁ','ভা','ভাঁ','ভি','ভিঁ','ভী','ভীঁ','ভু','ভুঁ','ভূ','ভূঁ','ভৃ','ভৃঁ','ভে','ভেঁ',
                                'ভৈ','ভৈঁ','ভো','ভোঁ','ভৌ','ভৌঁ','ভ্ব','ভ্বা','ভ্বি','ভ্বী','ভ্বু','ভ্বে','ভ্বো','ভ্য','ভ্যঁ','ভ্যা','ভ্যাঁ','ভ্যি','ভ্যী','ভ্যু',
                                'ভ্যুঁ','ভ্যূ','ভ্যে','ভ্যো','ভ্র','ভ্রঁ','ভ্রা','ভ্রি','ভ্রী','ভ্রু','ভ্রুঁ','ভ্রূ','ভ্রৃ','ভ্রে','ভ্রৈ','ভ্রো','ভ্রৌ','ম','মঁ','মা',
                                'মাঁ','মি','মিঁ','মী','মীঁ','মু','মুঁ','মূ','মূঁ','মৃ','মে','মেঁ','মৈ','মৈঁ','মো','মোঁ','মৌ','মৌঁ','ম্ন','ম্নঁ',
                                'ম্না','ম্নি','ম্নী','ম্নু','ম্নূ','ম্নৃ','ম্নে','ম্নৈ','ম্নো','ম্নৌ','ম্প','ম্পঁ','ম্পা','ম্পাঁ','ম্পি','ম্পী','ম্পু','ম্পূ','ম্পৃ','ম্পে',
                                'ম্পেঁ','ম্পৈ','ম্পো','ম্পৌ','ম্প্র','ম্প্রঁ','ম্প্রা','ম্প্রি','ম্প্রী','ম্প্রু','ম্প্রূ','ম্প্রৃ','ম্প্রে','ম্প্রৈ','ম্প্রো','ম্প্রৌ','ম্ফ','ম্ফা','ম্ফি','ম্ফী',
                                'ম্ফু','ম্ফূ','ম্ফে','ম্ফো','ম্ব','ম্বঁ','ম্বা','ম্বাঁ','ম্বি','ম্বী','ম্বু','ম্বূ','ম্বৃ','ম্বে','ম্বৈ','ম্বো','ম্বৌ','ম্ব্র','ম্ব্রা','ম্ব্রি',
                                'ম্ব্রী','ম্ব্রু','ম্ব্রে','ম্ব্রো','ম্ভ','ম্ভা','ম্ভি','ম্ভী','ম্ভু','ম্ভূ','ম্ভৃ','ম্ভে','ম্ভো','ম্ভৌ','ম্ভ্র','ম্ভ্রঁ','ম্ভ্রা','ম্ভ্রি','ম্ভ্রী','ম্ভ্রু',
                                'ম্ভ্রূ','ম্ভ্রৃ','ম্ভ্রে','ম্ভ্রৈ','ম্ভ্রো','ম্ভ্রৌ','ম্ম','ম্মঁ','ম্মা','ম্মি','ম্মী','ম্মু','ম্মূ','ম্মৃ','ম্মে','ম্মৈ','ম্মো','ম্মৌ','ম্য','ম্যঁ',
                                'ম্যা','ম্যাঁ','ম্যি','ম্যী','ম্যু','ম্যূ','ম্যৃ','ম্যে','ম্যেঁ','ম্যৈ','ম্যো','ম্যৌ','ম্র','ম্রঁ','ম্রা','ম্রি','ম্রী','ম্রু','ম্রূ','ম্রৃ',
                                'ম্রে','ম্রৈ','ম্রো','ম্রৌ','ম্ল','ম্লঁ','ম্লা','ম্লি','ম্লী','ম্লু','ম্লূ','ম্লৃ','ম্লে','ম্লৈ','ম্লো','ম্লৌ','য','যঁ','যা','যাঁ',
                                'যি','যিঁ','যী','যু','যুঁ','যূ','যূঁ','যৃ','যে','যেঁ','যৈ','যো','যোঁ','যৌ','য্য','য্যা','য্যাঁ','য্যি','য্যী','য্যু',
                                'য্যে','য্যো','র','রঁ','রা','রাঁ','রি','রিঁ','রী','রীঁ','রু','রুঁ','রূ','রৃ','রে','রেঁ','রৈ','রো','রোঁ','রৌ',
                                'র্ক','র্কা','র্কি','র্কী','র্কু','র্কূ','র্কৃ','র্কে','র্কো','র্কৌ','র্ক্য','র্ক্যা','র্ক্যু','র্ক্যৃ','র্ক্যে','র্খ','র্খা','র্খি','র্খী','র্খু',
                                'র্খে','র্খো','র্খোঁ','র্গ','র্গা','র্গাঁ','র্গি','র্গী','র্গু','র্গূ','র্গৃ','র্গে','র্গৈ','র্গো','র্গৌ','র্গ্য','র্গ্যা','র্গ্যি','র্গ্যু','র্গ্যে',
                                'র্গ্যো','র্গ্র','র্গ্রা','র্গ্রি','র্গ্রী','র্গ্রে','র্গ্রো','র্ঘ','র্ঘা','র্ঘি','র্ঘী','র্ঘু','র্ঘূ','র্ঘৃ','র্ঘে','র্ঘো','র্ঘ্য','র্ঘ্যা','র্ঘ্যু','র্ঘ্যে',
                                'র্ঘ্যৈ','র্চ','র্চা','র্চি','র্চিঁ','র্চী','র্চু','র্চূ','র্চৃ','র্চে','র্চৈ','র্চো','র্চৌ','র্চ্য','র্চ্যা','র্চ্যু','র্চ্যূ','র্ছ','র্ছা','র্ছি',
                                'র্ছী','র্ছু','র্ছূ','র্ছৃ','র্ছে','র্জ','র্জা','র্জি','র্জী','র্জু','র্জূ','র্জে','র্জো','র্জোঁ','র্জ্ঞ','র্জ্ঞা','র্জ্ঞে','র্জ্য','র্জ্যা','র্জ্যি',
                                'র্জ্যু','র্জ্যে','র্জ্যো','র্ঝ','র্ঝা','র্ঝি','র্ঝু','র্ঝুঁ','র্ঝো','র্ট','র্টা','র্টি','র্টী','র্টু','র্টূ','র্টে','র্টৈ','র্টো','র্ড','র্ডা',
                                'র্ডি','র্ডী','র্ডু','র্ডূ','র্ডে','র্ডো','র্ঢ্য','র্ঢ্যে','র্ণ','র্ণঁ','র্ণা','র্ণি','র্ণী','র্ণু','র্ণূ','র্ণৃ','র্ণে','র্ণো','র্ণ্য','র্ণ্যা',
                                'র্ণ্যে','র্ণ্যো','র্ত','র্তা','র্তাঁ','র্তি','র্তিঁ','র্তী','র্তু','র্তূ','র্তৃ','র্তে','র্তৈ','র্তো','র্ত্ম','র্ত্মা','র্ত্মী','র্ত্মে','র্ত্য','র্ত্যা',
                                'র্ত্যাঁ','র্ত্যি','র্ত্যী','র্ত্যু','র্ত্যূ','র্ত্যে','র্ত্যো','র্ত্র','র্ত্রা','র্ত্রি','র্ত্রী','র্ত্রু','র্ত্রৃ','র্ত্রে','র্থ','র্থা','র্থাঁ','র্থি','র্থী','র্থু',
                                'র্থূ','র্থৃ','র্থে','র্থৈ','র্থো','র্থৌ','র্থ্য','র্থ্যা','র্থ্যে','র্দ','র্দা','র্দি','র্দী','র্দু','র্দূ','র্দৃ','র্দে','র্দৈ','র্দো','র্দৌ',
                                'র্দ্ব','র্দ্বা','র্দ্বি','র্দ্বী','র্দ্বু','র্দ্বৃ','র্দ্বে','র্দ্বো','র্দ্র','র্দ্রা','র্দ্রি','র্দ্রী','র্দ্রে','র্দ্রো','র্ধ','র্ধা','র্ধি','র্ধী','র্ধু','র্ধূ',
                                'র্ধৃ','র্ধে','র্ধৈ','র্ধো','র্ধৌ','র্ধ্ব','র্ধ্বা','র্ধ্বি','র্ধ্বু','র্ধ্বে','র্ধ্বো','র্ন','র্না','র্নি','র্নী','র্নু','র্নূ','র্নৃ','র্নে','র্নৈ',
                                'র্নো','র্নৌ','র্প','র্পঁ','র্পা','র্পাঁ','র্পি','র্পী','র্পু','র্পূ','র্পৃ','র্পে','র্পো','র্পৌ','র্পৌঁ','র্ফ','র্ফা','র্ফাঁ','র্ফি','র্ফী',
                                'র্ফু','র্ফূ','র্ফে','র্ফো','র্ফৌ','র্ব','র্বঁ','র্বা','র্বাঁ','র্বি','র্বী','র্বু','র্বূ','র্বৃ','র্বে','র্বৈ','র্বো','র্বোঁ','র্বৌ','র্ব্য',
                                'র্ব্যা','র্ব্যি','র্ব্যু','র্ব্যৃ','র্ব্যে','র্ভ','র্ভা','র্ভাঁ','র্ভি','র্ভী','র্ভু','র্ভূ','র্ভৃ','র্ভে','র্ভো','র্ভৌ','র্ম','র্মঁ','র্মা','র্মাঁ',
                                'র্মি','র্মী','র্মীঁ','র্মু','র্মূ','র্মৃ','র্মে','র্মেঁ','র্মো','র্মৌ','র্ম্য','র্ম্যঁ','র্ম্যা','র্ম্যী','র্ম্যূ','র্ম্যে','র্য','র্যা','র্যাঁ','র্যি',
                                'র্যী','র্যু','র্যূ','র্যৃ','র্যে','র্যৈ','র্যো','র্যৌ','র্ল','র্লা','র্লাঁ','র্লি','র্লী','র্লু','র্লূ','র্লৃ','র্লে','র্লো','র্শ','র্শা',
                                'র্শি','র্শী','র্শু','র্শৃ','র্শে','র্শৈ','র্শো','র্শৌ','র্শ্ব','র্শ্বা','র্শ্বি','র্শ্বী','র্শ্বে','র্শ্বৈ','র্শ্বো','র্শ্য','র্শ্যূ','র্শ্যে','র্ষ','র্ষঁ',
                                'র্ষা','র্ষি','র্ষী','র্ষু','র্ষূ','র্ষে','র্ষৈ','র্ষো','র্ষ্য','র্ষ্যা','র্ষ্যি','র্ষ্যূ','র্ষ্যে','র্স','র্সা','র্সাঁ','র্সি','র্সিঁ','র্সী','র্সু',
                                'র্সূ','র্সৃ','র্সে','র্সৈ','র্সো','র্সৌ','র্হ','র্হা','র্হি','র্হী','র্হু','র্হূ','র্হৃ','র্হে','র্হৈ','র্হো','র্হৌ','র্হ্য','র্হ্যা','ল',
                                'লঁ','লা','লাঁ','লি','লিঁ','লী','লীঁ','লু','লুঁ','লূ','লৃ','লে','লেঁ','লৈ','লো','লোঁ','লৌ','ল্ক','ল্কঁ','ল্কা',
                                'ল্কি','ল্কী','ল্কু','ল্কূ','ল্কৃ','ল্কে','ল্কৈ','ল্কো','ল্কৌ','ল্ক্য','ল্ক্যা','ল্ক্যে','ল্গ','ল্গঁ','ল্গা','ল্গি','ল্গী','ল্গু','ল্গূ','ল্গৃ',
                                'ল্গে','ল্গৈ','ল্গো','ল্গৌ','ল্ট','ল্টঁ','ল্টা','ল্টি','ল্টী','ল্টু','ল্টূ','ল্টৃ','ল্টে','ল্টৈ','ল্টো','ল্টোঁ','ল্টৌ','ল্ড','ল্ডঁ','ল্ডা',
                                'ল্ডি','ল্ডী','ল্ডু','ল্ডূ','ল্ডৃ','ল্ডে','ল্ডৈ','ল্ডো','ল্ডৌ','ল্প','ল্পঁ','ল্পা','ল্পি','ল্পী','ল্পু','ল্পূ','ল্পৃ','ল্পে','ল্পৈ','ল্পো',
                                'ল্পৌ','ল্ফ','ল্ফা','ল্ফি','ল্ফী','ল্ফু','ল্ফে','ল্ফো','ল্ব','ল্বঁ','ল্বা','ল্বাঁ','ল্বি','ল্বী','ল্বু','ল্বুঁ','ল্বূ','ল্বৃ','ল্বে','ল্বৈ',
                                'ল্বো','ল্বৌ','ল্ভ','ল্ভঁ','ল্ভা','ল্ভি','ল্ভী','ল্ভু','ল্ভূ','ল্ভৃ','ল্ভে','ল্ভৈ','ল্ভো','ল্ভৌ','ল্ম','ল্মঁ','ল্মা','ল্মি','ল্মী','ল্মু',
                                'ল্মূ','ল্মৃ','ল্মে','ল্মৈ','ল্মো','ল্মৌ','ল্য','ল্যঁ','ল্যা','ল্যাঁ','ল্যি','ল্যী','ল্যু','ল্যুঁ','ল্যূ','ল্যে','ল্যৈ','ল্যো','ল্ল','ল্লঁ',
                                'ল্লা','ল্লাঁ','ল্লি','ল্লী','ল্লু','ল্লূ','ল্লৃ','ল্লে','ল্লৈ','ল্লো','ল্লোঁ','ল্লৌ','শ','শঁ','শা','শাঁ','শি','শিঁ','শী','শীঁ',
                                'শু','শুঁ','শূ','শূঁ','শৃ','শে','শেঁ','শৈ','শো','শোঁ','শৌ','শৌঁ','শ্চ','শ্চঁ','শ্চা','শ্চাঁ','শ্চি','শ্চিঁ','শ্চী','শ্চু',
                                'শ্চূ','শ্চৃ','শ্চে','শ্চৈ','শ্চো','শ্চৌ','শ্ছ','শ্ছা','শ্ছি','শ্ছৃ','শ্ছে','শ্ন','শ্নঁ','শ্না','শ্নি','শ্নী','শ্নু','শ্নূ','শ্নৃ','শ্নে',
                                'শ্নৈ','শ্নো','শ্নৌ','শ্ব','শ্বা','শ্বাঁ','শ্বি','শ্বী','শ্বীঁ','শ্বু','শ্বৃ','শ্বে','শ্বৈ','শ্বো','শ্বৌ','শ্ম','শ্মঁ','শ্মা','শ্মি','শ্মী',
                                'শ্মু','শ্মৃ','শ্মে','শ্মো','শ্মৌ','শ্য','শ্যঁ','শ্যা','শ্যাঁ','শ্যি','শ্যী','শ্যু','শ্যূ','শ্যৃ','শ্যে','শ্যৈ','শ্যো','শ্যৌ','শ্র','শ্রঁ',
                                'শ্রা','শ্রি','শ্রী','শ্রীঁ','শ্রু','শ্রূ','শ্রৃ','শ্রে','শ্রৈ','শ্রো','শ্রৌ','শ্ল','শ্লঁ','শ্লা','শ্লি','শ্লী','শ্লু','শ্লূ','শ্লৃ','শ্লে',
                                'শ্লৈ','শ্লো','শ্লৌ','ষ','ষঁ','ষা','ষাঁ','ষি','ষিঁ','ষী','ষীঁ','ষু','ষুঁ','ষূ','ষৃ','ষে','ষেঁ','ষৈ','ষো','ষোঁ',
                                'ষৌ','ষ্ক','ষ্কা','ষ্কি','ষ্কী','ষ্কু','ষ্কূ','ষ্কৃ','ষ্কে','ষ্কো','ষ্কৌ','ষ্ক্র','ষ্ক্রঁ','ষ্ক্রা','ষ্ক্রি','ষ্ক্রী','ষ্ক্রু','ষ্ক্রূ','ষ্ক্রৃ','ষ্ক্রে',
                                'ষ্ক্রৈ','ষ্ক্রো','ষ্ক্রৌ','ষ্ট','ষ্টঁ','ষ্টা','ষ্টি','ষ্টিঁ','ষ্টী','ষ্টু','ষ্টূ','ষ্টৃ','ষ্টে','ষ্টৈ','ষ্টো','ষ্টৌ','ষ্ট্য','ষ্ট্যা','ষ্ট্যি','ষ্ট্যু',
                                'ষ্ট্যে','ষ্ট্যো','ষ্ট্র','ষ্ট্রঁ','ষ্ট্রা','ষ্ট্রি','ষ্ট্রী','ষ্ট্রু','ষ্ট্রূ','ষ্ট্রৃ','ষ্ট্রে','ষ্ট্রৈ','ষ্ট্রো','ষ্ট্রৌ','ষ্ঠ','ষ্ঠা','ষ্ঠি','ষ্ঠী','ষ্ঠু','ষ্ঠূ',
                                'ষ্ঠৃ','ষ্ঠে','ষ্ঠৈ','ষ্ঠো','ষ্ঠৌ','ষ্ঠ্য','ষ্ঠ্যা','ষ্ঠ্যি','ষ্ঠ্যু','ষ্ঠ্যে','ষ্ণ','ষ্ণা','ষ্ণি','ষ্ণী','ষ্ণু','ষ্ণূ','ষ্ণে','ষ্ণো','ষ্ণৌ','ষ্প',
                                'ষ্পা','ষ্পি','ষ্পী','ষ্পু','ষ্পূ','ষ্পৃ','ষ্পে','ষ্পো','ষ্পৌ','ষ্প্র','ষ্প্রঁ','ষ্প্রা','ষ্প্রি','ষ্প্রী','ষ্প্রু','ষ্প্রূ','ষ্প্রৃ','ষ্প্রে','ষ্প্রৈ','ষ্প্রো',
                                'ষ্প্রৌ','ষ্ফ','ষ্ফা','ষ্ফি','ষ্ফী','ষ্ফু','ষ্ফূ','ষ্ফে','ষ্ফো','ষ্ব','ষ্বা','ষ্বি','ষ্বী','ষ্ম','ষ্মা','ষ্মি','ষ্মী','ষ্মু','ষ্মৃ','ষ্মে',
                                'ষ্মো','ষ্য','ষ্যা','ষ্যি','ষ্যী','ষ্যু','ষ্যূ','ষ্যে','ষ্যৈ','ষ্যো','স','সঁ','সা','সাঁ','সি','সিঁ','সী','সীঁ','সু','সুঁ',
                                'সূ','সূঁ','সৃ','সৃঁ','সে','সেঁ','সৈ','সো','সোঁ','সৌ','সৌঁ','স্ক','স্কঁ','স্কা','স্কাঁ','স্কি','স্কী','স্কু','স্কূ','স্কৃ',
                                'স্কে','স্কৈ','স্কো','স্কৌ','স্ক্র','স্ক্রঁ','স্ক্রা','স্ক্রি','স্ক্রী','স্ক্রু','স্ক্রূ','স্ক্রৃ','স্ক্রে','স্ক্রৈ','স্ক্রো','স্ক্রৌ','স্খ','স্খঁ','স্খা','স্খি',
                                'স্খী','স্খু','স্খূ','স্খৃ','স্খে','স্খৈ','স্খো','স্খৌ','স্ট','স্টঁ','স্টা','স্টি','স্টী','স্টু','স্টুঁ','স্টূ','স্টৃ','স্টে','স্টেঁ','স্টৈ',
                                'স্টো','স্টৌ','স্ট্র','স্ট্রঁ','স্ট্রা','স্ট্রি','স্ট্রী','স্ট্রু','স্ট্রূ','স্ট্রৃ','স্ট্রে','স্ট্রৈ','স্ট্রো','স্ট্রৌ','স্ত','স্তঁ','স্তা','স্তাঁ','স্তি','স্তী',
                                'স্তু','স্তুঁ','স্তূ','স্তৃ','স্তে','স্তেঁ','স্তৈ','স্তো','স্তোঁ','স্তৌ','স্ত্ব','স্ত্বা','স্ত্বি','স্ত্বু','স্ত্বে','স্ত্য','স্ত্যা','স্ত্যাঁ','স্ত্যু','স্ত্যে',
                                'স্ত্যৈ','স্ত্র','স্ত্রা','স্ত্রি','স্ত্রী','স্ত্রু','স্ত্রূ','স্ত্রৃ','স্ত্রে','স্ত্রৈ','স্ত্রো','স্থ','স্থঁ','স্থা','স্থি','স্থী','স্থু','স্থূ','স্থৃ','স্থে',
                                'স্থৈ','স্থো','স্থৌ','স্থ্য','স্থ্যঁ','স্থ্যা','স্থ্যি','স্থ্যী','স্থ্যু','স্থ্যূ','স্থ্যৃ','স্থ্যে','স্থ্যৈ','স্থ্যো','স্থ্যৌ','স্ন','স্নঁ','স্না','স্নি','স্নী',
                                'স্নু','স্নূ','স্নৃ','স্নে','স্নৈ','স্নো','স্নৌ','স্প','স্পঁ','স্পা','স্পাঁ','স্পি','স্পী','স্পু','স্পূ','স্পৃ','স্পে','স্পৈ','স্পো','স্পৌ',
                                'স্প্র','স্প্রা','স্প্রি','স্প্রী','স্প্রু','স্প্রূ','স্প্রে','স্প্রো','স্প্ল','স্প্লা','স্প্লি','স্প্লী','স্প্লে','স্ফ','স্ফঁ','স্ফা','স্ফাঁ','স্ফি','স্ফী','স্ফু',
                                'স্ফূ','স্ফৃ','স্ফে','স্ফৈ','স্ফো','স্ফৌ','স্ব','স্বঁ','স্বা','স্বি','স্বী','স্বু','স্বূ','স্বৃ','স্বে','স্বৈ','স্বো','স্বৌ','স্ম','স্মঁ',
                                'স্মা','স্মি','স্মী','স্মু','স্মূ','স্মৃ','স্মে','স্মৈ','স্মো','স্মৌ','স্য','স্যঁ','স্যা','স্যাঁ','স্যি','স্যী','স্যু','স্যূ','স্যৃ','স্যে',
                                'স্যেঁ','স্যৈ','স্যো','স্যৌ','স্র','স্রঁ','স্রা','স্রি','স্রী','স্রু','স্রূ','স্রৃ','স্রে','স্রৈ','স্রো','স্রৌ','স্ল','স্লঁ','স্লা','স্লি',
                                'স্লী','স্লু','স্লূ','স্লৃ','স্লে','স্লৈ','স্লো','স্লৌ','হ','হঁ','হা','হাঁ','হি','হিঁ','হী','হীঁ','হু','হুঁ','হূ','হূঁ',
                                'হৃ','হে','হেঁ','হৈ','হৈঁ','হো','হোঁ','হৌ','হৌঁ','হ্ণ','হ্ণা','হ্ণি','হ্ণী','হ্ণু','হ্ণে','হ্ন','হ্নঁ','হ্না','হ্নাঁ','হ্নি',
                                'হ্নী','হ্নু','হ্নূ','হ্নৃ','হ্নে','হ্নৈ','হ্নো','হ্নৌ','হ্ব','হ্বঁ','হ্বা','হ্বি','হ্বী','হ্বু','হ্বূ','হ্বৃ','হ্বে','হ্বৈ','হ্বো','হ্বৌ',
                                'হ্ম','হ্মা','হ্মি','হ্মী','হ্মু','হ্মে','হ্মৈ','হ্মো','হ্মৌ','হ্য','হ্যঁ','হ্যা','হ্যাঁ','হ্যি','হ্যী','হ্যু','হ্যূ','হ্যৃ','হ্যে','হ্যেঁ',
                                'হ্যো','হ্র','হ্রা','হ্রি','হ্রী','হ্রু','হ্রূ','হ্রৃ','হ্রে','হ্রো','হ্ল','হ্লঁ','হ্লা','হ্লি','হ্লী','হ্লু','হ্লূ','হ্লৃ','হ্লে','হ্লৈ',
                                'হ্লো','হ্লৌ','ৎ','ৎঁ','ৎু','ড়','ড়ঁ','ড়া','ড়াঁ','ড়ি','ড়িঁ','ড়ী','ড়ীঁ','ড়ু','ড়ুঁ','ড়ূ','ড়ৃ','ড়ে','ড়েঁ','ড়ৈ',
                                'ড়ো','ড়োঁ','ড়ৌ','ঢ়','ঢ়ঁ','ঢ়া','ঢ়ি','ঢ়িঁ','ঢ়ী','ঢ়ু','ঢ়ুঁ','ঢ়ূ','ঢ়ৃ','ঢ়ে','ঢ়েঁ','ঢ়ৈ','ঢ়ো','ঢ়োঁ','ঢ়ৌ','য়',
                                'য়ঁ','য়া','য়াঁ','য়ি','য়িঁ','য়ী','য়ু','য়ুঁ','য়ূ','য়ূঁ','য়ৃ','য়ে','য়েঁ','য়ৈ','য়ো','য়োঁ','য়ৌ'] 
    
    # vocab
    unicodes                 =     sorted(vowels+consonants+vowel_diacritics+consonant_diacritics+special_charecters+numbers+punctuations) 
    graphemes                =     sorted(dict_graphemes+numbers+punctuations)


#----------------------------------------- add all language info-------------------------------------------------------------
languages={}
languages["bangla"]=bangla
languages["english"]=english

class vocab:
    class unicodes:
        all  =["pad","start","end","sep"]+sorted(list(set(english.graphemes+bangla.unicodes)))
    class graphemes: 
        all =["pad","start","end","sep"]+sorted(list(set(english.graphemes+bangla.graphemes)))


